{"config": [{"config": {"activation": "tanh", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "use_bias": true, "trainable": true, "kernel_regularizer": null, "dtype": "float32", "activity_regularizer": null, "bias_constraint": null, "units": 100, "kernel_constraint": null, "batch_input_shape": [null, 2], "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "tanh", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "use_bias": true, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "units": 100, "kernel_constraint": null, "name": "dense_2", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "use_bias": true, "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "units": 2, "kernel_constraint": null, "name": "dense_3", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "keras_version": "2.0.4", "class_name": "Sequential", "backend": "tensorflow"}