{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "relu", "batch_input_shape": [null, 20], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "name": "dense_1", "units": 64, "dtype": "float32", "trainable": true, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "relu", "name": "dense_2", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "trainable": true, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "softmax", "name": "dense_3", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "trainable": true, "kernel_regularizer": null}}], "keras_version": "2.0.4"}